Repository: lebao3105/text-editor
Catalog: po/*.po
Languages: vi

source: Cannot find file name %s - create it?
vi: Không thấy tệp %s - tạo nó?

source: File not found
vi: Không thấy tệp

source: You are running this program as root. You must be responsible for your changes.
vi: Chương trình đang được chạy dưới quyền quản trị viên (admin). Hãy sống có trách nhiệm, cho cả những thay đổi bạn tạo ra ở đây.

source: Exception caught
vi: Phát hiện ngoại lệ

source: An error occured and textworker caught it:
vi: Một lỗi xảy ra và textworker đã phát hiện ra nó:

source: File
vi: Tập tin

source: Line
vi: Dòng

source: Function
vi: Hàm

source: Called code
vi: Mã được gọi

source: About this application
vi: Về ứng dụng này

source: Click to view in full size
vi: Bấm vào để xem kích thước đầy đủ

source: Project version
vi: Phiên bản dự án

source: Home page
vi: Trang chủ

source: Click to open
vi: Bấm để mở

source: Description
vi: Mô tả

source: A simple and small text editor. Textworker allows its users to write many things they want, with gradually added new and cool features. Free and open source!
vi: Một trình sửa văn bản nhỏ và đơn gain. Textworker cho phép người dùng viết những thứ họ muốn, với những tính năng mới dần được them vào. Miễn phí và nguồn mở!

source: About
vi: Về ứng dụng này

source: This program is made possible thanks to:
vi: Chương trình này được tạo ra với:

source: Developers
vi: Nhà phát triển

source: Artists
vi: Họa sĩ

source: Documentation writers
vi: Người viết tài liệu

source: License
vi: Giấy phép

source: 30 seconds
vi: 30 giây

source: 1 minute
vi: Một phút

source: 2 minutes
vi: Hai phút

source: 5 minutes
vi: Năm phút

source: 10 minutes
vi: Mười phút

source: 15 minutes
vi: 15 phút

source: 20 minutes
vi: 20 phút

source: 30 minutes
vi: 30 phút

source: Auto-saving document configure
vi: Cài đặt tự động lưu

source: Time format: minutes
vi: Thời gian được để dưới dạng phút

source: Changes are automatically applied.
vi: Mọi thay đổi đều được tự động áp dụng.

source: Save this permanently
vi: Lưu giá trị này

source: New tab
vi: Tab mới

source: Open a file
vi: Mở tập tin

source: Open folder
vi: Mở thư mục

source: Open directory in a new window
vi: Mở thư mục ở cửa sổ mới

source: Open a folder...
vi: Mở một thư mục...

source: Recents
vi: Gần đây

source: Save
vi: Lưu

source: Save as...
vi: Lưu như...

source: Close all tabs
vi: Đóng tất cả tab

source: Quit
vi: Thoát

source: Undo
vi: Hoàn nguyên

source: Redo
vi: Thực hiện lại

source: Cut
vi: Cắt

source: Copy
vi: Sao chép

source: Paste
vi: Dán

source: Select all
vi: Chọn hết

source: Find
vi: Tìm

source: Replace
vi: Thay thế

source: Configure
vi: Cài đặt

source: Is turned on?
vi: Được bật chưa?

source: Global
vi: Chung

source: The current editor
vi: Trình chỉnh sửa hiện tại

source: Auto Save
vi: Tự động lưu

source: Edit
vi: Chỉnh sửa

source: Zoom in
vi: Phóng to

source: Zoom out
vi: Thu nhỏ

source: Wrap by word
vi: Ngắ́t dòng

source: Show indentation guides
vi: Hiện đường chỉ thụt lề

source: View document as a HTML page
vi: Xem tài liệu dưới dạng một trang HTML

source: View
vi: Xem

source: Settings...
vi: Cài đặt...

source: Reset everything
vi: Hoàn lại mọi thứ

source: Open the configuration directory
vi: Mở thu mục cài đặt

source: Settings
vi: Cài đặt

source: System specs
vi: Cấu hình hệ thống

source: Show logs
vi: Hiện nhật kí

source: Show inspector
vi: Mở một inspector

source: Report issues...
vi: Báo cáo sự cố...

source: Read documents
vi: Đọc tài liệu

source: Help
vi: Trợ giúp

source: Log
vi: Nhật kí

source: This will only affect to this session
vi: Chỉ áp dụng cho phiên hiện tại

source: Select a folder to start
vi: Mở một thư mục để bắt đầu

source: Are you sure want to reset every settings? If so, finish your work first. (and you will need to reopen yourself)
vi: Bạn có chắc mình muốn hoàn lại mọi cài đặt? Nếu vậy thì hoàn thành công việc của bạn trước, vì chương trình sẽ đóng sau tác vụ hoàn tác. (và bạn phải tự mở lại nó)

source: Reset confirmation
vi: Xác nhận reset

source: Unknown
vi: Không xác định

source: Textworker version {appver} Branch: {"Nightly" if is_development_version(appver) else "Stable"} libtextworker verison {libver} wxPython version: {wx.__version__} Python version: {platform.python_version()} OS type: {ostype} OS version {platform.version()} Machine architecture: {platform.machine()}
vi: Textworker {appver} Kênh {"Nightly" if is_development_version(appver) else "Stable"} libtextworker phiên bản {libver} wxPython phiên bản {wx.__version__} Python {platform.python_version()} Loại hệ điều hành: {ostype} Phiên bản hệ điều hành: {platform.version()} Hệ máy {platform.machine()}

source: Close the current tab
vi: Đóng tab đang mở

source: Disable this (open) tab
vi: Khóa tab đang mở

source: Close the side bar
vi: Đóng thanh bên

source: App updates
vi: Bản cập nhật ứng dụng

source: Automatically?
vi: Tự động?

source: Check for updates
vi: Kiểm tra cập nhật

source: View release notes (requires internet)
vi: Đọc release note (yêu cầu internet)

source: Interface
vi: Giao diện

source: Notebook tabs location
vi: Vị trí đặt tab

source: Left
vi: Trái

source: Right
vi: Phải

source: Top
vi: Trên

source: Bottom
vi: Dưới

source: Font
vi: Phông chữ

source: General
vi: Chung

source: Automatic
vi: Tự động

source: Dark
vi: Tối

source: Light
vi: Sáng

source: Color schemes
vi: Chế độ màu

source: Customize
vi: Tùy biến

source: Background
vi: Màu nền

source: Foreground
vi: Màu chữ

source: Background (dark mode)
vi: Màu nền (chế độ tối)

source: Foreground (dark mode)
vi: Màu chữ (chế độ tối)

source: Different colors for dark/light mode (WIP)
vi: Màu cho từng chế độ sáng/tối (WIP)

source: Themes
vi: Chủ đề

source: Pre-made
vi: Được tạo sẵn

source: Create new
vi: Tạo mới

source: Do it
vi: Thực hiện

source: If you want to make a new theme, create and switch to it first before doing any color changes.
vi: Nếu bạn muốn tạo chủ đề mới, tạo và chuyển sang nó trước khi tạo bất cứ thay đổi nào.

source: Colors
vi: Màu

source: Indentation
vi: Thụt lề

source: Is enabled?
vi: Đã bật?

source: Enabled - use tabs
vi: Bật - dùng tab

source: Enabled - use spaces
vi: Bật - dùng dấu cách

source: Disabled
vi: Tắt

source: Size
vi: Cỡ

source: Backspace clears the indentation
vi: Backspace xóa thụt lề gần nhất

source: View whitespaces
vi: Xem dấu cách

source: View end-of-line (EOL)
vi: Xem kí hiệu hết dòng (EOL - End Of Line)

source: Line numbers
vi: Hiện số dòng

source: Save settings
vi: Lưu cài đặt

source: If you want to make new settings pack, create and switch to it first before doing any changes.
vi: Nếu bạn muốn tạo một pack cài đặt mới, tạo và chuyển sang nó trước khi tạo bất cứ thay đổi nào.

source: Editors
vi: Các editor

source: Restart the application to get the effect
vi: Khởi động lại ứng dụng để thấy sự thay đổi

source: Completed
vi: Đã xong

source: Error while setting a new theme: Name required.
vi: Lỗi khi tạo một chủ đề mới: chưa đặt tên.

source: The program is up-to-date
vi: Chương trình này đang ở phiên bản mới nhất

source: Invalid response received
vi: Nhận được phản hồi không hợp lệ

source: Your editor is outdated: new {result[0]} from branch {branch}.
vi: Có bản cập nhật: {result[0]} từ kênh {branch}.

source: Update available
vi: Có bản cập nhật mới

source: Untitled
vi: Không tên

source: New file
vi: Tập tin mới

source: Save this to...
vi: Lưu tệp này tới...

source: Save {path}? It has unsaved changes.
vi: Lưu {path}? Nó có thay đổi chưa được lưu.

source: Not saved
vi: Chưa được lưu
