Repository: lebao3105/text-editor
Catalog: po/*/LC_MESSAGES/*.po
Languages: vi

source: Text Editor
vi: Trinh chinh sua van ban

source: No other tabs left, asking for close the window...
vi: Khong con mot tab nao o day, chuan bi dong cua so...

source: Copy
vi: Sao chep

source: Paste
vi: Dan

source: Cut
vi: Cat

source: Save
vi: Luu

source: Save as
vi: Luu nhu

source: Undo
vi: Hoan tac

source: Redo
vi: Thuc hien lai

source: Available commands:
vi: Cac lenh co san:

source: exit: Close this box
vi: exit: Dong hop nay

source: help: Show this message
vi: help: Hien hop thoai nay

source: Running application which requires user input is not recommended yet.
vi: Chay chuong trinh yeu cau nhap o day la khong nen cho lam.

source: This will open console defined by defconsole value in configuration file. The application will be temporarity unusable!
vi: No se mo trinh gia lap dong lenh duoc chon boi gia tri defconsole trong file cai dat. Ung dung se tam thoi khong su dung duoc!

source: Warning
vi: Canh bao

source: Find something here...
vi: Tim mot thu gi do...

source: Find
vi: Tim

source: Replace
vi: Thay the

source: Select a file to open
vi: Chon mot tep de mo

source: Text editor
vi: Trinh chinh sua van ban

source: Infomation
vi: Thong tin

source: Notification
vi: Thong bao

source: There are unsaved files. Are you want to save them?
vi: O day co mot so tep chua luu. Ban co muon luu chung?

source: Are you sure want to quit the application?
vi: Ban co chac muon thoat chuong trinh nay?
